Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: གང་པོ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ཡིན་ནོ། །
en: Pūrṇa, this is how bodhisattva great beings practice the perfection of concentration and uphold the perfection of generosity.”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཐབས་ལ་མཁས་པ་འདི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་གང་ལགས་པར་རིག་པར་བགྱི།
en: Pūrṇa asked, “Honorable Blessed One, what are such skillful bodhisattva great beings like?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་དེ་ནི་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་པར་རིག་པར་བྱའོ།
en: The Blessed One said, “Pūrṇa, they are nonregressing bodhisattvas.”

source: །གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཇི་ཙམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སེམས་ཅན་དཔག་ཏུ་མ་མཆིས་པའི་སླད་དུ་གོ་ཆ་ཆེན་པོ་བགོས་ཏེ། བདག་གིས་སེམས་ཅན་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་བྱའོ།
en: Pūrṇa said, “Honorable Blessed One, when bodhisattva great beings don the great armor for the sake of limitless beings, they think, ‘I will bring limitless beings to nirvāṇa.

source: །བདག་གིས་སངས་རྒྱས་ཀྱི་ཚུལ་རྒྱུན་མི་འཆད་པར་བྱ་བའི་ཕྱིར་འབད་པར་བྱའོ་སྙམ་སྟེ།
en: I will ensure that the way of the Buddha remains uninterrupted.’

source: འོན་ཀྱང་འདི་ལ་ཡོངས་སུ་མྱ་ངན་ལས་ཟློ་བ་གང་ལགས་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ཡང་མ་མཆིས་པ་ནི་དཀའ་བ་བགྱིད་པ་སྟེ།
en: And they undertake hardship when all the while the one who passes into nirvāṇa, the act of passing into nirvāṇa, and the full awakening to unsurpassed and perfect buddhahood do not exist.

source: ངོ་མཚར་ཆེ་བར་རིག་པར་བགྱི་བ་ལགས་སོ།
en: That is amazing!”

source: །བཀའ་སྩལ་པ། གང་པོ་དེ་ལྟ་མོད་ཀྱི་སྡུག་བསྔལ་སྐྱེ་བར་འགྱུར་བ་ཉིད་ནི་སྐྱེ། སྡུག་བསྔལ་འགག་པར་འགྱུར་བ་ནི་འགག་སྟེ།
en: The Blessed One said, “Pūrṇa, that is certainly true. However, they do undergo suffering and they do bring suffering to an end.

source: གང་པོ་དེའི་ཕྱིར་རྣམ་གྲངས་འདིས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དཀའ་བ་བྱེད་པར་རིག་པར་བྱའོ།
en: Therefore, in this way one should regard bodhisattva great beings as undertaking hardships.”

source: །གང་པོས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་སོ། །དེ་དེ་ལྟ་ལགས་ཏེ།
en: Pūrṇa said, “Honorable Blessed One, quite so, that is correct.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་དཀའ་བ་བགྱིད་པ་ལགས་པར་རིག་པར་བགྱི་བ་ལགས་སོ། །
en: One should understand that bodhisattvas do undertake hardships.

source: འདི་ལྟར་མྱ་ངན་ལས་ཟློ་བ་གང་ལགས་པའམ། མྱ་ངན་ལས་འདའ་བར་འགྱུར་བའམ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་ཆོས་འགའ་ཡང་མི་དམིགས་ལ། སེམས་ཅན་དཔག་ཏུ་མ་མཆིས་པ་རྣམས་ཀྱི་ཆེད་དུ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས།
en: That is because they awaken to unsurpassed and perfect buddhahood for the sake of limitless beings without any focus on someone passing into nirvāṇa, the act of passing into nirvāṇa, or the full awakening to unsurpassed and perfect buddhahood.

source: སེམས་ཅན་དེ་དག་གི་འདོད་ཆགས་སྤང་བ་དང་། ཞེ་སྡང་སྤང་བ་དང་། གཏི་མུག་སྤང་བའི་སླད་དུ་ཆོས་ཀྱང་སྟོན་པའི་སླད་དུ་ལགས་སོ།
en: Having done so, they teach the Dharma in order to eradicate the attachment, anger, and delusion of all beings.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་རྣམ་པར་མི་གཡེང་བར་གནས་ཤིང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་འབྱུང་བ་འདི་ནི། དེའི་བསམ་གཏན་དང་ལྡན་པར་རིག་པར་བྱའོ།
en: The Blessed One said, “Pūrṇa, if bodhisattvas rest without distraction and contemplate the state of omniscience, you should know that they possess concentration.

source: །གང་པོ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་ཀྱི་ས་དང་ལྡན་པའམ། རང་སངས་རྒྱས་ཀྱི་ས་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་འབྱུང་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་རྣམ་པར་གཡེང་བ་ཡིན་པར་རིག་པར་བྱའོ།
en: Pūrṇa, if bodhisattvas contemplate the levels of the hearers and the solitary buddhas, you should know that they are distracted bodhisattvas.

source: འདི་ལྟར་དེ་ནི་དེའི་འཇིགས་པར་བྱ་བ་ཡིན་པའི་ཕྱིར་རོ།
en: Because those are to be feared.

source: །གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུགས་ལ་དམིགས་པའམ། སྒྲ་ལ་དམིགས་པའམ། དྲི་ལ་དམིགས་པའམ། རོ་ལ་དམིགས་པའམ། རེག་པ་ལ་དམིགས་པ་ཡིད་ལ་བྱེད་པ་འབྱུང་ན།
en: Pūrṇa, moreover, if it should happen that bodhisattva great beings begin to conceptualize by focusing on form, sound, smell, taste, or texture, that may certainly become the basis for their mind to become distracted.

source: གཞི་དེ་ལས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་རྣམ་པར་གཡེང་བར་འགྱུར་མོད་ཀྱི། ཆོས་འདི་དག་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་བར་ཆད་བྱེད་པར་ཉེ་བར་གནས་པ་མ་ཡིན་ནོ། །ཆོས་གང་དག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཆད་བྱེད་པར་ཉེ་བར་གནས་པ་མ་ཡིན་པ་དེ་ཉིད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཏིང་ངེ་འཛིན་གྱི་ས་ཡིན་པར་རིག་པར་བྱའོ།
en: Nevertheless, these phenomena do not pose an obstacle for the state of omniscience, and any phenomenon that does not pose an obstacle for the state of omniscience belongs at the level of the absorption of bodhisattva great beings.”

source: །བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ལེའུ་གཉིས་པའོ།། །།
en: This is the second chapter from “The Perfection of Concentration.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་དོན་གྱི་དབང་ཅི་ཞིག་གཟིགས་ན། འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤང་བར་བགྱི་བ་བསྔགས་པ་མཛད་ལ། ཉན་ཐོས་རྣམས་ཀྱི་ནི་མ་ལགས།
en: Venerable Pūrṇa Maitrāyaṇīputra asked the Blessed One, “Blessed One, why does the thus-gone, worthy, perfect Buddha, who sees the truth, praise the abandonments of the bodhisattvas but not those of the hearers?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་དེའི་ཕྱིར་འདིར་ཁྱོད་ཉིད་ལ་དྲི་བར་བྱས།
en: The Blessed One said, “Pūrṇa, since you ask that, let me ask you a question in return.

source: ཁྱོད་ཇི་ལྟར་བཟོད་པ་བཞིན་དུ་ལན་ཐོབ་ཤིག །
en: Bear with me as I give you a reply.

source: གང་པོ་འདི་སྙམ་དུ་སེམས། ཉི་མའི་དཀྱིལ་འཁོར་འཛམ་བུའི་གླིང་གི་མི་རྣམས་ལ་བྱ་བ་གང་གིས་ཉེ་བར་གནས་པ་བཞིན་དུ། སྲོག་ཆགས་ཀྱི་རིགས་སྲིན་བུ་མེ་ཁྱེར་ཡང་བྱ་བ་དེ་ཉིད་ཀྱིས་ཉེ་བར་གནས་སམ།
en: Pūrṇa, tell me, do fireflies perform the same function as the sun when it comes to shining on the people of this earth?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱ་བ་གང་གིས་ཉེ་བར་གནས་པ་དེས་ཉན་ཐོས་ཉེ་བར་གནས་པ་མ་ཡིན་ནོ།
en: The Blessed One said, “Pūrṇa, similarly, the actions of the hearers cannot compare to the actions of the bodhisattva great beings.

source: །གང་པོ་འདི་ཇི་སྙམ་དུ་སེམས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱ་བ་གང་གིས་ཉེ་བར་གནས་སྙམ།
en: Pūrṇa, tell me, what types of action are the bodhisattvas engaged in?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདི་ལྟ་བུས་གནས་ཏེ། བདག་གིས་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་བྱའོ།
en: Pūrṇa said, “Blessed One, bodhisattva great beings are engaged in thoughts like, ‘I will bring all countless and limitless beings to nirvāṇa.

source: །བདག་གིས་སངས་རྒྱས་ཀྱི་གདུང་མི་འཆད་པར་བྱ་བར་བསྒྲུབ་པར་བྱའོ་སྙམ་པའི་བྱ་བ་དེས་ཉེ་བར་གནས་པ་ལགས་ཏེ།
en: I will make sure that the lineage of the Buddha remains uninterrupted.’

source: ཉན་ཐོས་རྣམས་ནི་དེ་ལྟ་མ་ལགས་སོ།
en: The hearers are not like that.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་འདི་ཇི་སྙམ་དུ་སེམས། ཉན་ཐོས་ཀྱི་དགེ་འདུན་འདིའི་ནང་ན་དགེ་སློང་གཅིག་ཙམ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བྱ་བ་གང་གིས་ཉེ་བར་གནས་པའི་བྱ་བ་དེས་ཉེ་བར་གནས་པ་ཁྱོད་ཀྱིས་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངམ།
en: The Blessed One said, “Pūrṇa, tell me, within this community of hearers, do you see even a single monk who is engaged in the actions that the bodhisattvas engage in?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་མཆིས་སོ། །
en: Pūrṇa said, “No, Blessed One, I do not.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་དོན་གྱི་དབང་འདི་ཡང་དག་པར་གཟིགས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འབའ་ཞིག་གི་སྤང་བར་བྱ་བ་བསྔགས་ཀྱི་ཉན་ཐོས་རྣམས་ཀྱི་ནི་དེ་ལྟ་མ་ཡིན་ནོ།
en: The Blessed One said, “Pūrṇa, it is because the thus-gone, worthy, perfect Buddha perceives the power of these facts that he exclusively praises the abandonments of the bodhisattva great beings but not those of the hearers.

source: །གང་པོ་དཔེར་ན། ཉི་མའི་དཀྱིལ་འཁོར་ནི་འཛམ་བུའི་གླིང་གི་མི་རྣམས་ལ་སྣང་བ་དཔག་ཏུ་མེད་པས་ཉེ་བར་གནས་པ་ཡིན་ལ་སྲོག་ཆགས་ཀྱི་རིགས་སྲིན་བུ་མེ་ཁྱེར་ནི། འདི་ལྟར་རང་གི་རྒྱུད་ཉི་ཚེ་སྣང་བར་ཉེ་བར་གནས་པར་ཟད་དོ།
en: Pūrṇa, as an analogy, the sun bathes all the people of this earth in a boundless light, whereas fireflies merely shine with a very limited glow that only illuminates themselves.

source: །གང་པོ་དེ་བཞིན་དུ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་གང་ཟག་ནི་འདི་ལྟར་རང་གི་རྒྱུད་ཉི་ཚེའི་ཉོན་མོངས་པ་བཟློག་པའི་ཕྱིར་ཉེ་བར་གནས་པར་ཟད་ཀྱི།
en: Pūrṇa, in the same way, those who are following the vehicle of the hearers merely act to repel the trifling afflictions of their own being.

source: གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་བདག་དང་གཞན་མྱ་ངན་ལས་བཟླ་བའི་ཕྱིར་དང་། སེམས་ཅན་དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད་པ་རྣམས་ཀྱི་དོན་གྱི་ཕྱིར་དང་། ཉོན་མོངས་པ་བཟློག་པའི་ཕྱིར་ཉེ་བར་གནས་པ་ཡིན་ན།
en: On the other hand, Pūrṇa, bodhisattvas engage in actions aimed at bringing themselves and others to nirvāṇa, securing the welfare of countless and limitless beings, and repelling all afflictions.

source: གང་པོ་དཔེར་ན། འཕོང་གི་སློབ་དཔོན་མཚོན་ཆ་ལ་གོམས་ཤིང་མཁས་པར་གྱུར་པ་ནི་ལོ་གཅིག་ཏུ་ཡང་རྒྱལ་པོའི་ཀཱར་ཥཱ་པ་ཎ་བརྒྱ་སྟོང་ཟ་ཞིང་།
en: Pūrṇa, as an analogy, a master archer, who is familiar with weaponry and skilled in its use, may collect a yearly salary of one hundred thousand kārṣāpaṇa coins from the king.

source: གང་གི་ཚེ་རྒྱལ་པོ་གཡུལ་འགྱེད་པའི་དུས་ལ་བབ་པ་དེའི་ཚེ། ཇི་ལྟར་འཕོང་གི་སློབ་དཔོན་དེ་རལ་གྲིས་འདེབས་སམ། མདའ་འཕེན་པ་ན། ཐམས་ཅད་དུ་དེ་གདོན་མི་ཟ་བར་བྱེད་པ་ལྟར་གླང་པོ་ཆེ་དང་། རྟ་དང་། མི་གཞན་གྱིས་བྱ་བ་དེ་མི་བྱེད་དོ། །
en: Whenever the time comes for the king to go into battle, the master archer will always wield his sword and loose his arrows without any hesitation, in a manner that no elephant rider, horse rider, or soldier can.

source: གང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་འདོད་ཆགས་སྤྱོད་པ་དང་། ཞེ་སྡང་སྤྱོད་པ་དང་། གཏི་མུག་སྤྱོད་པ་རྣམས་ཀྱི་ཆེད་དུ་གོ་ཆ་གྱོན་ཏེ། སེམས་ཅན་དེ་དག་གི་ཕྱིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་འདོད་ཆགས་སྤང་བའི་ཕྱིར་དང་།
en: Pūrṇa, in the same way, bodhisattva great beings will don armor for the sake of others who are involved in attachment, anger, and delusion, so that they can awaken to unsurpassed and perfect buddhahood for the sake of everyone else.

source: ཞེ་སྡང་སྤང་བའི་ཕྱིར་དང་། གཏི་མུག་སྤང་བའི་ཕྱིར་ཆོས་ཀྱང་སྟོན་ཏོ།
en: Having awakened in this manner, they will also teach the Dharma so that others can abandon their attachment, anger, and delusion.

source: །གང་པོ་དེས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཡིན་ནོ། །
en: Pūrṇa, thus the bodhisattva great beings don the great armor.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་བདག་གིས་འཚལ་བ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ནམ་ཡང་མཉམ་པར་མ་བཞག་པ་མ་མཆིས་པར་རིག་པར་བགྱིའོ།
en: Pūrṇa said, “As I understand the meaning expressed by the Blessed One, bodhisattva great beings never cease to rest in equipoise.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ན་ཡང་མཉམ་པར་གཞག་པར་རིག་པར་བགྱིའོ།
en: Even when bodhisattva great beings practice the perfection of generosity, they rest in equipoise.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ན་ཡང་། མཉམ་པར་གཞག་པར་རིག་པར་བགྱིའོ། །
en: Even when bodhisattva great beings practice the perfection of discipline, the perfection of patience, the perfection of diligence, the perfection of concentration, or the perfection of insight, they are resting in equipoise.

source: བཅོམ་ལྡན་འདས་དཔེར་བགྱི་ན།
en: Blessed One, let me give an analogy.

source: ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུརྱ་ནི་གསེར་གྱི་སྣོད་དུ་བཞག་ན་ཡང་། རིན་པོ་ཆེའི་རང་བཞིན་མི་འདོར་ལ།
en: Even if a beryl gemstone were placed in a golden vessel, it would not lose its precious nature.

source: དེ་བཞིན་དུ་དངུལ་གྱི་སྣོད་དང་། ཤེལ་གྱི་སྣོད་དང་། ལྕགས་ཀྱི་སྣོད་དུ་བཞག་ན་ཡང་རིན་པོ་ཆེའི་རང་བཞིན་མི་འདོར་ཏེ།
en: Likewise, neither would it lose its precious nature if it were placed in a silver vessel, a crystal vessel, or even an iron vessel.

source: དེ་བཞིན་དུ་ཁམ་པའི་སྣོད་དང་། ས་ལ་བཞག་ན་ཡང་རིན་པོ་ཆེའི་རང་བཞིན་མི་འདོར་ལགས་སོ།
en: Even if it were placed in a clay pot or put in the soil, it would not lose its precious nature.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ན་ཡང་མཉམ་པར་གཞག་པར་རིག་པར་བགྱིའོ།
en: Blessed One, likewise, even when bodhisattva great beings practice the perfection of generosity, they are resting in equipoise.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ན་ཡང་མཉམ་པར་གཞག་པར་རིག་པར་བགྱི་སྟེ།
en: Even when they practice the perfection of discipline, the perfection of patience, the perfection of diligence, the perfection of concentration, and the perfection of insight do they rest in equipoise.

source: དེ་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་དོན་བདག་གིས་འཚལ་ཏོ།
en: This is how I understand the meaning expressed by the Blessed One.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གང་པོ་ལེགས་སོ་ལེགས་སོ།
en: Then the Blessed One said to Venerable Pūrṇa Maitrāyaṇīputra, “Pūrṇa, excellent, excellent!

source: །གང་པོ་དེ་དེ་བཞིན་ནོ།
en: Pūrṇa, that is correct!

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདོད་པ་རྣམས་ལས་དབེན་པ། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་བསྒྲུབས་ཏེ་གནས་ཤིང་།
en: If bodhisattva great beings are free of desires and unwholesome wicked ways and possess conceptual and discursive thought, that freedom will cause them to accomplish and rest in the first concentration in which they feel well-being and bliss.

source: བསམ་གཏན་དང་པོ་ལ་གནས་པ་ན་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་ས་ལ་འདོད་པར་བྱེད་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་རྣམ་པར་གཡེངས་པ་ཡིན་པར་རིག་པར་བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཉམ་པར་མ་བཞག་པའི་ས་ལ་གནས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: However, as they maintain that first concentration level, should they wish for the levels of the hearers or the solitary buddhas, those bodhisattva great beings are distracted and should be known as bodhisattva great beings who are on the level of not resting in equipoise. “

source: །གང་པོ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟོག་པ་དང་དཔྱོད་པ་རྣམས་དང་བྲལ་ཞིང་། ནང་ཡོངས་སུ་དང་སྟེ། སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་རྟོག་པ་མེད་པ་དཔྱོད་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལས་སྐྱེ་བའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་བསྒྲུབས་ཏེ་གནས་ཤིང་།
en: Pūrṇa, moreover, if bodhisattva great beings are free from conceptual and discursive thought, have an inner lucidity and a one-pointed mind, the absorption in which there is no conceptual and discursive thought will cause them to accomplish and rest in the second concentration in which they feel well-being and bliss.

source: བསམ་གཏན་གཉིས་པ་ལ་གནས་པ་ན་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་ས་ལ་འདོད་པར་བྱེད་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་རྣམ་པར་གཡེངས་པ་ཡིན་པར་རིག་པར་བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཉམ་པར་མ་བཞག་པའི་ས་ལ་གནས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: However, as they maintain that second concentration level, should they wish for the levels of the hearers or the solitary buddhas, those bodhisattva great beings are distracted and should be known as bodhisattva great beings who are on the level of not resting in equipoise. “

source: །གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགའ་བའི་འདོད་ཆགས་དང་བྲལ་བས་བཏང་སྙོམས་ལ་གནས་ཤིང་། དྲན་པ་དང་ཤེས་བཞིན་ཅན་ཡིན་ཏེ། བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ།
en: Pūrṇa, moreover, when bodhisattva great beings are without attachment to joy, they can rest in equipoise while mindful, aware, and with an experience of physical pleasure.

source: འཕགས་པ་རྣམས་ཀྱིས་གང་དེ་དྲན་པ་དང་ལྡན་པ་བདེ་བ་ལ་གནས་པ། བཏང་སྙོམས་པའོ་ཞེས་བརྗོད་པ་སྟེ།
en: The noble ones describe this as a state of mindful and blissful equipoise.

source: དགའ་བ་མེད་པ་བསམ་གཏན་གསུམ་པ་བསྒྲུབས་ཏེ་གནས་ཤིང་།
en: Thus they accomplish and rest in the third concentration, which is without joy.

source: བསམ་གཏན་གསུམ་པ་ལ་གནས་པ་ན་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་ས་ལ་འདོད་པར་བྱེད་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་རྣམ་པར་གཡེངས་པ་ཡིན་པར་རིག་པར་བྱ་སྟེ། མཉམ་པར་མ་བཞག་པའི་ས་ལ་གནས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: However, as they maintain that third concentration level, should they wish for the levels of the hearers or the solitary buddhas, those bodhisattva great beings are distracted and should be known as bodhisattva great beings who are on the level of not resting in equipoise. “

source: །གང་པོ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་བདེ་བ་ཡང་སྤངས། སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་། སྔ་ནས་ཡིད་བདེ་བ་དང་། ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་བདེ་བ་ཡང་མ་ཡིན། སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པ།
en: Pūrṇa, moreover, when bodhisattvas have abandoned both happiness and suffering, they are beyond happiness and suffering, since both happiness and unhappiness have subsided.

source: བཏང་སྙོམས་དང་དྲན་པ་ཡོངས་སུ་དག་པ། བསམ་གཏན་བཞི་པ་བསྒྲུབས་ཏེ་གནས་ཤིང་།
en: At that point, as their equipoise and mindfulness are pure, they accomplish and rest in the fourth concentration.

source: བསམ་གཏན་བཞི་པ་ལ་གནས་པ་ན་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་ས་ལ་འདོད་པར་བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་རྣམ་པར་གཡེངས་པ་ཡིན་པར་རིག་པར་བྱ་སྟེ། མཉམ་པར་མ་བཞག་པའི་ས་ལ་གནས་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: However, as they maintain that fourth concentration level, should they wish for the levels of the hearers or the solitary buddhas, those bodhisattva great beings are distracted and should be known as bodhisattva great beings who are on the level of not resting in equipoise.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པར་གཞག་པར་རིག་པར་བགྱི།
en: Pūrṇa asked, “Blessed One, what are bodhisattvas like who rest in equipoise?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་གང་དང་གང་མཐོང་བ་དེ་དང་དེ་ལ་འདི་ལྟར་སེམས་ཅན་འདི་དག་ནི། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་གདུལ་བར་བྱ་བ་ཡིན་ནོ་སྙམ་དུ་སེམས་སྐྱེད་ན། བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པར་གཞག་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: The Blessed One said, “Pūrṇa, when bodhisattva great beings observe anyone, regardless of who they are, they will think, ‘When I awaken to unsurpassed and perfect buddhahood, I will guide this being.’ If they form this resolve, they are bodhisattvas who rest in equipoise.

source: །གང་པོ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཕ་རོལ་སྐྱབས་སུ་འགྲོ་བ་གསུམ་ལ་བཀོད་ལ་བཀོད་ནས་ཀྱང་། དགེ་བའི་རྩ་བ་དེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ན། བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པར་གཞག་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: Pūrṇa, moreover, when bodhisattvas cause another being to take refuge in the three objects of refuge and dedicate the roots of virtue to the state of omniscience, they are bodhisattvas who rest in equipoise.

source: གང་པོ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཕ་རོལ་བསླབ་པའི་གཞི་ལྔ་ལ་བཀོད་ལ། བཀོད་ནས་ཀྱང་དགེ་བའི་རྩ་བ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན། བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པར་གཞག་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: Pūrṇa, moreover, if bodhisattvas establish another being in the five foundations for training and dedicate the roots of virtue toward unsurpassed and perfect awakening, they are bodhisattvas who rest in equipoise.

source: གང་པོ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཕ་རོལ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་ལ། བཀོད་ནས་ཀྱང་དགེ་བའི་རྩ་བ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན། བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པར་གཞག་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Pūrṇa, moreover, if bodhisattvas establish another being on the path of the ten virtuous actions and dedicate the roots of virtue toward unsurpassed and perfect awakening, they are bodhisattvas who rest in equipoise.

source: །གང་པོ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གཞན་སྦྱིན་པ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་བྱེད། གནས་པར་བྱེད། འགོད་པར་བྱེད། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་བྱེད། གནས་པར་བྱེད། འགོད་པར་བྱེད་ལ། བཀོད་ནས་ཀྱང་དགེ་བའི་རྩ་བ་དེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ན། བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པར་གཞག་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: Pūrṇa, moreover, if bodhisattvas cause another son or daughter of noble family to take up, continue with, and remain in the practice of generosity as well as the practices of discipline, patience, diligence, concentration, and insight, and dedicate the roots of virtue to the state of omniscience, they are bodhisattvas who rest in equipoise.

source: གང་པོ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཐ་ན་ཕ་རོལ་སྦྱིན་པ་བྱེད་པ་རྣམས་ལ་ཡང་རྗེས་སུ་ཡི་རང་བར་བྱེད་ལ། རྗེས་སུ་ཡི་རང་བའི་བསོད་ནམས་དེ་ཡང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ན། བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པར་གཞག་པ་ཡིན་པར་རིག་པར་བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Pūrṇa, moreover, even if bodhisattvas only rejoice in those who practice the perfections and dedicate the roots of virtue of rejoicing toward the state of omniscience, they are bodhisattvas who rest in equipoise and bodhisattvas who practice the perfection of concentration.

source: འདི་ལྟར་དེས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱེད་པ་ཡོངས་སུ་མ་སྤངས་པའི་ཕྱིར་རོ།
en: Because by doing so, they avoid forsaking their engagement with omniscience. “

source: །གང་གི་ཚེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱེད་པ་དང་མ་བྲལ་ན། དེ་ཉིད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པར་རིག་པར་བྱའོ།
en: Whenever they are not failing to be engaged with omniscience, they are practicing the bodhisattva great beings’ perfection of concentration.

source: །དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡང་གནས་པ་ཡིན་ནོ།
en: This is how bodhisattvas practice the perfection of concentration.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ། བསམ་གཏན་ལ་རྟེན་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: When bodhisattva great beings practice the perfection of concentration and rely on concentration, they awaken to unsurpassed and perfect buddhahood.

source: །དེ་བཞིན་གཤེགས་པ་ཡང་མི་གཡོ་བའི་གནས་ལ་གནས་ནས། ཚེའི་འདུ་བྱེད་འདོར་བར་མཛད་དེ། ལེན་པ་མེད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་ཡང་མཛད་དོ།
en: It is also by resting in the unwavering abode and relinquishing the continuation of life that the Thus-Gone One passes into nirvāṇa beyond further craving.

source: །གང་པོ་དེ་ལྟར་ན་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་ལ་ཕན་འདོགས་པར་གྱུར་པ་ཡིན་ནོ།
en: Pūrṇa, in this way the perfection of concentration benefits the bodhisattvas who seek to awaken to unsurpassed and perfect buddhahood.

source: །གང་པོ་བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་ནི། དེ་བཞིན་གཤེགས་པའི་བསམ་གཏན་མ་གཏོགས་པར་དེ་ལས་གཞན་པའི་བསམ་གཏན་རྣམས་ཀྱི་མཆོག་ཅེས་བྱའོ། །
en: Pūrṇa, apart from the concentration of a thus-gone one, the concentration of the bodhisattvas is said to be the best in comparison to any other form of concentration.

source: གཙོ་བོ་དང་། ཕུལ་དང་། རབ་དང་། རབ་མཆོག་དང་། གྱ་ནོམ་པ་དང་། བླ་ན་མེད་པ་དང་། གོང་ན་མེད་པ་ཞེས་བྱའོ།
en: It is supreme, foremost, superior, preeminent, sublime, unsurpassed, and unexcelled.

source: གང་པོ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་རྣམས་དང་མ་བྲལ་བ་ཡིན་ལ། ཉན་ཐོས་ཀྱི་བསམ་གཏན་ལ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་རྣམས་མེད་པའི་ཕྱིར་རོ། །
en: Because, Pūrṇa, the concentration of the bodhisattvas is always concerned with the state of omniscience, whereas the concentration of the hearers lacks any concern with omniscience.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཉན་ཐོས་བསམ་གཏན་ལ་གནས་པས་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཆོས་ཉིད་གང་དང་ལྡན་པའི་ཆོས་ཉིད་དེ་མངོན་སུམ་དུ་བགྱིད་ན།
en: Venerable Pūrṇa Maitrāyaṇīputra asked the Blessed One, “Blessed One, when the hearers practice concentration, they do actualize the suchness that is the suchness of the blessed buddhas.
